trade/src/InformationRegisters/НастройкиЗаполненияДополнительныхПолей/НастройкиЗаполненияДополнительныхПолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаполненияДополнительныхПолей</name>
  <resources>
    <name>Настройка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентомЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЭлектронногоДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Формат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьФормат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьНастройкаЭДО</name>
    <type>
      <types>CatalogRef.УдалитьСоглашенияОбИспользованииЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидЭлектронногоДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам/НастройкиОтправкиЭлектронныхДокументовПоВидам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправкиЭлектронныхДокументовПоВидам</name>
  <resources>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаршрутПодписания</name>
    <type>
      <types>CatalogRef.МаршрутыПодписания</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОтветнаяПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Формировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаУстановленаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнениеКодаТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОтправителя</name>
    <comment>Адрес отправителя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресПолучателя</name>
    <comment>Адрес получателя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменБезПодписи</name>
    <comment>Признак использования подписи при прямом обмене</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентомЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПрикладнойВидЭД</name>
    <type>
      <types>DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/НастройкиПолученияЭлектронныхДокументов/НастройкиПолученияЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПолученияЭлектронныхДокументов</name>
  <resources>
    <name>СпособОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеПредлагатьСохранятьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПрикладнойВидЭД</name>
    <type>
      <types>DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Documents/ЭлектронныйДокументВходящийЭДО/ЭлектронныйДокументВходящийЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронныйДокументВходящийЭДО</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАннулирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентомЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокументооборота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОзнакомлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменБезПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольОтраженияВУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>EnumRef.ПричиныОстановкиЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитМаркируемыеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбмена</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегламента</name>
    <type>
      <types>EnumRef.ТипыРегламентовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяИзвещение</name>
    <comment>Требуется извещение от получателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <comment>Требуется подпись получателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияРегламента</name>
    <type>
      <types>EnumRef.ВерсииРегламентаОбмена1С</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОшибкиПередачи</name>
    <type>
      <types>EnumRef.УдалитьВидыОшибокПередачиЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидПрикладногоДокумента</name>
    <type>
      <types>DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзмененияСостоянияЭДО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьПравилаОтраженияВУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеДокументаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНастройкаЭДО</name>
    <type>
      <types>CatalogRef.УдалитьСоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерДокумента</name>
    <comment>Без учета исправления</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПрофильНастроекЭДО</name>
    <type>
      <types>CatalogRef.УдалитьПрофилиНастроекЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПрочитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояниеЭДО</name>
    <type>
      <types>EnumRef.СостоянияДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипДокумента</name>
    <type>
      <types>EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипЭлементаВерсииЭД</name>
    <type>
      <types>EnumRef.ТипыЭлементовРегламентаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОсновногоТитула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОблачныйЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИдентификаторыОснований</name>
    <comment>Хранит уникальные идентификаторы документов оснований (документы информационной базы на основании которых введен Владелец файла в базе инициатора ЭДО) и признак необходимости связки основания и потомка</comment>
    <attributes>
      <name>ИдентификаторСвязи</name>
      <comment>Идентификатор связи основания внутренний</comment>
      <type>
        <types>DefinedType.ИдентификаторДокументаОснованияЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокументооборота</name>
      <type>
        <types>DefinedType.ИдентификаторДокументаОснованияЭДО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованияЭлектронныхДокументовЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДополнительныеВидыЭД</name>
    <attributes>
      <name>ВидЭД</name>
      <type>
        <types>EnumRef.ТипыДокументовЭДО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/CommonModules/НастройкиЭДОСлужебный/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Описание
// 
// Параметры:
// 	ПараметрыПолучения - см. НастройкиЭДОСлужебныйКлиентСервер.НовыеПараметрыПолученияДанныхДляНастройкиСвязиСКонтрагентом
// Возвращаемое значение:
// 	Структура:
// * ПроверкаСертификатов - Структура:
//    ** ЕстьДоступныеСертификаты - Булево
//    ** ОжидаетсяВыпускСертификата - Булево
// * ОтпечаткиСертификатов - см. КриптографияБЭД.ПолучитьОтпечаткиСертификатов
// * ИдентификаторыОрганизации - СписокЗначений - см. РаботаСАбонентамиЭДО.ДанныеПоИдентификаторамАбонентов , 
//                               ключ ИдентификаторыОрганизации функции.
// * ПараметрыСвязиИдентификаторовЭДО - ТаблицаЗначений, Неопределено - 
//          см. РаботаСАбонентамиЭДО.ДанныеПоИдентификаторамАбонентов , ключ ПараметрыСвязиИдентификаторовЭДО функции
Функция ДанныеДляНастройкиСвязиСКонтрагентом(ПараметрыПолучения) Экспорт
	
	СтруктураВозврата = Новый Структура(
		"ПроверкаСертификатов,
		|ИдентификаторыОрганизации,
		|ПараметрыСвязиИдентификаторовЭДО");
	
	ДоступныеСертификаты = КриптографияБЭД.ПользователюДоступенСертификатИлиЗаявлениеНаВыпуск(ПараметрыПолучения.Организация,
		ПараметрыПолучения.ОтпечаткиСертификатов);
	СтруктураВозврата.ПроверкаСертификатов = ДоступныеСертификаты;
	
	НовыеПараметрыПолученияДанныхАбонентов = РаботаСАбонентамиЭДО.НовыеПараметрыПолученияДанныхАбонентов();
	НовыеПараметрыПолученияДанныхАбонентов.Организация = ПараметрыПолучения.Организация;
	НовыеПараметрыПолученияДанныхАбонентов.Контрагент = ПараметрыПолучения.Контрагент;
	НовыеПараметрыПолученияДанныхАбонентов.ИдентификаторКонтрагента = ПараметрыПолучения.ИдентификаторКонтрагента;
	НовыеПараметрыПолученияДанныхАбонентов.ИдентификаторОрганизации = ПараметрыПолучения.ИдентификаторОрганизации;
	НовыеПараметрыПолученияДанныхАбонентов.ПриоритетПодключенные = ПараметрыПолучения.ПриоритетПодключенные;
	
	ДанныеПоИдентификаторамАбонентов = РаботаСАбонентамиЭДО.ДанныеПоИдентификаторамАбонентов(
		НовыеПараметрыПолученияДанныхАбонентов);
	СтруктураВозврата.ИдентификаторыОрганизации = ДанныеПоИдентификаторамАбонентов.ИдентификаторыОрганизации;
	СтруктураВозврата.ПараметрыСвязиИдентификаторовЭДО =
		ДанныеПоИдентификаторамАбонентов.ПараметрыСвязиИдентификаторовЭДО;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Получение текста предупреждений отправки документа по выбранным настройкам обмена ЭДО
//
// Параметры:
//  КлючНастроекОтправки  - см. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
//  ИдентификаторПолучателя - Строка
//  ФорматДокумента - Строка
//  ДатаПроверки - Дата
// Возвращаемое значение:
//  Структура   - Найденные предупреждения.
//
Функция ПредупрежденияПоНастройкеОбменаНаДату(КлючНастроекОтправки, ИдентификаторПолучателя = "",
	ФорматДокумента = "", ДатаПроверки = Неопределено) Экспорт
	
	Предупреждения = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запросы = Новый Массив;
	
	Отбор = РаботаСАбонентамиЭДО.НовыйОтборАбонентовЭДО();
	Отбор.ИдентификаторЭДО = "&ИдентификаторПолучателя";
	Отбор.ЭтоПользователь1С = Истина;
	ЗапросАбонентов = РаботаСАбонентамиЭДО.ЗапросАбонентовЭДО("АбонентыЭДО", Отбор);
	Запросы.Добавить(ЗапросАбонентов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АбонентыЭДО.СрокДействияСертификатов <= &ТекущаяДата
		|		И АбонентыЭДО.СрокДействияСертификатов <> &ПустаяДата КАК СрокДействияСертификатов,
		|	АбонентыЭДО.ДатаПоследнейАктивности <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -2)
		|		И АбонентыЭДО.ДатаПоследнейАктивности <> &ПустаяДата КАК ДатаПоследнейАктивности,
		|	АбонентыЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	АбонентыЭДО.КраткоеОписание КАК КраткоеОписание
		|ИЗ
		|	АбонентыЭДО КАК АбонентыЭДО";
	
	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроекОтправки);
	
	Если НастройкиОтправки = Неопределено Тогда
		НастройкиОтправки = НастройкиЭДОКлиентСервер.НоваяНастройкаОтправки();
		НастройкиОтправки.Отправитель = КлючНастроекОтправки.Отправитель;
		НастройкиОтправки.Получатель = КлючНастроекОтправки.Получатель;
		НастройкиОтправки.ВидДокумента = КлючНастроекОтправки.ВидДокумента;
		НастройкиОтправки.ИдентификаторПолучателя = ИдентификаторПолучателя;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФорматДокумента) Тогда
		ФорматДокумента = НастройкиОтправки.Формат;
	КонецЕсли;
	
	ДанныеОФорматах = ДанныеОФорматахОтправителяИПолучателя(КлючНастроекОтправки.ВидДокумента,
		ФорматДокумента, НастройкиОтправки.ИдентификаторПолучателя, ДатаПроверки);
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("ИдентификаторПолучателя", НастройкиОтправки.ИдентификаторПолучателя);
	ИтоговыйЗапрос.УстановитьПараметр("ТекущаяДата"            , ТекущаяДатаСеанса());
	ИтоговыйЗапрос.УстановитьПараметр("ПустаяДата"             , Дата(1, 1, 1));
	
	РезультатЗапроса = ИтоговыйЗапрос.Выполнить();
	
	АбонентыЭДО = РезультатЗапроса.Выбрать();
	Пока АбонентыЭДО.Следующий() Цикл
		
		Если ЗначениеЗаполнено(АбонентыЭДО.КраткоеОписание) Тогда
			ТекстИдентификатора = СтрШаблон(НСтр("ru = '%1 (%2)'"), АбонентыЭДО.ИдентификаторЭДО, АбонентыЭДО.КраткоеОписание);
		Иначе
			ТекстИдентификатора = АбонентыЭДО.ИдентификаторЭДО;
		КонецЕсли;
		
		Если АбонентыЭДО.СрокДействияСертификатов Тогда
			ДобавитьПредупреждениеСрокДействияСертификатов(Предупреждения, ТекстИдентификатора);
		КонецЕсли;
		
		Если АбонентыЭДО.ДатаПоследнейАктивности Тогда
			ДобавитьПредупреждениеДатаПоследнейАктивности(Предупреждения, ТекстИдентификатора);
		КонецЕсли;
	КонецЦикла;
	
	ФорматыОтправителя = ДанныеОФорматах.ФорматыОтправителя;
	Если ФорматыОтправителя <> Неопределено Тогда
		
		УстаревшийФорматКонтрагента = Новый Структура;
		УстаревшийФорматКонтрагента.Вставить("ВидЭД"                                   , ФорматыОтправителя.ВидДокумента);
		УстаревшийФорматКонтрагента.Вставить("Отправитель_НовыйФормат_Представление"  , ФорматыОтправителя.Отправитель_НовыйФормат_Представление);
		УстаревшийФорматКонтрагента.Вставить("Отправитель_НовыйФормат_СсылкаНаПриказ" , ФорматыОтправителя.Отправитель_НовыйФормат_СсылкаНаПриказ);
		УстаревшийФорматКонтрагента.Вставить("Отправитель_Формат_Представление"       , ФорматыОтправителя.Отправитель_Формат_Представление);
		УстаревшийФорматКонтрагента.Вставить("Отправитель_Формат_СсылкаНаПриказ"       , ФорматыОтправителя.Отправитель_Формат_СсылкаНаПриказ);
		УстаревшийФорматКонтрагента.Вставить("ПоддерживаетсяКонфигурацией"             , ФорматыОтправителя.ПоддерживаетсяКонфигурацией);
		
		ДобавитьПредупреждениеУстаревшийФорматОтправителя(Предупреждения, УстаревшийФорматКонтрагента,
			ФорматыОтправителя.Регламентированный);
	КонецЕсли;
	
	ФорматыПолучателя = ДанныеОФорматах.ФорматыПолучателя;
	Если ФорматыПолучателя <> Неопределено Тогда
		Если ФорматыПолучателя.Устарел Тогда
			УстаревшийФорматКонтрагента = Новый Структура;
			УстаревшийФорматКонтрагента.Вставить("ВидЭД"                             , ФорматыПолучателя.ВидДокумента);
			УстаревшийФорматКонтрагента.Вставить("Получатель_Формат_Представление"   , ФорматыПолучателя.Получатель_Формат_Представление);
			УстаревшийФорматКонтрагента.Вставить("Получатель_Формат_СсылкаНаПриказ"  , ФорматыПолучателя.Получатель_Формат_СсылкаНаПриказ);
			УстаревшийФорматКонтрагента.Вставить("Отправитель_Формат_Представление" , ФорматыПолучателя.Отправитель_Формат_Представление);
			УстаревшийФорматКонтрагента.Вставить("Отправитель_Формат_СсылкаНаПриказ" , ФорматыПолучателя.Отправитель_Формат_СсылкаНаПриказ);
			
			ДобавитьПредупреждениеУстаревшийФорматПолучателя(Предупреждения, УстаревшийФорматКонтрагента);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Предупреждения;
	
КонецФункции

Процедура ДобавитьПредупреждениеСрокДействияСертификатов(Предупреждения, УчетнаяЗапись)
	
	Предупреждение = ИнтерфейсДокументовЭДОКлиентСервер.НовыеДанныеПредупрежденияКомпонента();
	Предупреждение.Вид = НастройкиЭДО.ВидыПредупреждений().СрокДействияСертификатов;
	Предупреждение.ТекстОшибки = СтрШаблон(НСтр("ru = 'У учетной записи %1 отсутствуют действующие сертификаты. Документ можно отправить, но он не будет получен, пока контрагент не перевыпустит хотя бы один сертификат. Рекомендуем связаться с контрагентом и сообщить о данной проблеме.'"), УчетнаяЗапись);
	Предупреждения.Добавить(Предупреждение);
	
КонецПроцедуры

Процедура ДобавитьПредупреждениеДатаПоследнейАктивности(Предупреждения, УчетнаяЗапись)
	
	Предупреждение = ИнтерфейсДокументовЭДОКлиентСервер.НовыеДанныеПредупрежденияКомпонента();
	Предупреждение.Вид = НастройкиЭДО.ВидыПредупреждений().ДатаПоследнейАктивностиПолучателя;
	Предупреждение.ТекстОшибки = СтрШаблон(НСтр("ru = 'Контрагент последний раз использовал  учетную запись %1  более 2 месяцев назад. Возможно он ей уже не пользуется'"), УчетнаяЗапись);
	Предупреждения.Добавить(Предупреждение);
	
КонецПроцедуры

Процедура ДобавитьПредупреждениеУстаревшийФорматОтправителя(Предупреждения, УстаревшийФорматОтправителя, Регламентированный)
	
	УстаревшийФормат = СтрШаблон("<a href='%1'>%2</a>",
			УстаревшийФорматОтправителя.Отправитель_Формат_СсылкаНаПриказ,
			УстаревшийФорматОтправителя.Отправитель_Формат_Представление);
	АктуальныйФормат = СтрШаблон("<a href='%1'>%2</a>",
			УстаревшийФорматОтправителя.Отправитель_НовыйФормат_СсылкаНаПриказ,
			УстаревшийФорматОтправителя.Отправитель_НовыйФормат_Представление);
	
	Если Регламентированный Тогда
		Если УстаревшийФорматОтправителя.ПоддерживаетсяКонфигурацией Тогда
			Решение = НСтр("ru = 'Чтобы отправка документов стала возможна, необходимо изменить настройки отправки документа'");
		Иначе
			Решение = НСтр("ru = 'Чтобы отправка документов стала возможна, необходимо обновить конфигурацию'");
		КонецЕсли;
	Иначе
		Если УстаревшийФорматОтправителя.ПоддерживаетсяКонфигурацией Тогда
			Решение = НСтр("ru = 'Измените настройки отправки документа и повторите создание документа'");
		Иначе
			Решение = НСтр("ru = 'По возможности обновите конфигурацию.'");
		КонецЕсли;
	КонецЕсли;
	
	Шаблон = НСтр("ru = 'Для обмена документами ""<b>%1</b>"" используется устаревший формат ""%2"". Актуальным является формат ""%3"". %4'");
	ТекстОшибки = СтроковыеФункции.ФорматированнаяСтрока(Шаблон, Строка(УстаревшийФорматОтправителя.ВидЭД),
		УстаревшийФормат, АктуальныйФормат, Решение);
	
	Предупреждение = ИнтерфейсДокументовЭДОКлиентСервер.НовыеДанныеПредупрежденияКомпонента();
	Предупреждение.Вид = НастройкиЭДО.ВидыПредупреждений().УстаревшийФорматОтправителя;
	Предупреждение.ТекстОшибки = ТекстОшибки;
	Если Регламентированный Тогда
		Предупреждение.Блокирующее = Истина;
	КонецЕсли;
	Предупреждения.Добавить(Предупреждение);
	
КонецПроцедуры

Процедура ДобавитьПредупреждениеУстаревшийФорматПолучателя(Предупреждения, УстаревшийФорматПолучателя)
	
	УстаревшийФормат = СтрШаблон("<a href='%1'>%2</a>",
		УстаревшийФорматПолучателя.Получатель_Формат_СсылкаНаПриказ,
		УстаревшийФорматПолучателя.Получатель_Формат_Представление);
	АктуальныйФормат = СтрШаблон("<a href='%1'>%2</a>",
		УстаревшийФорматПолучателя.Отправитель_Формат_СсылкаНаПриказ,
		УстаревшийФорматПолучателя.Отправитель_Формат_Представление);
	
	Решение = НСтр("ru = 'Чтобы отправка документов стала возможна, необходимо изменить настройки отправки документа'");
	
	Шаблон = НСтр("ru = 'Контрагент использует для обмена документами ""<b>%1</b>"" устаревший формат ""%2"". Документ будет отправлен в формате ""%3"", вследствие чего у получателя могут возникнуть проблемы при отображении документа. По возможности свяжитесь контрагентом и порекомендуйте обновить программное обеспечение'");
	ТекстОшибки = СтроковыеФункции.ФорматированнаяСтрока(Шаблон, Строка(УстаревшийФорматПолучателя.ВидЭД),
		УстаревшийФормат, АктуальныйФормат, Решение);
	
	Предупреждение = ИнтерфейсДокументовЭДОКлиентСервер.НовыеДанныеПредупрежденияКомпонента();
	Предупреждение.Вид = НастройкиЭДО.ВидыПредупреждений().УстаревшийФорматОтправителя;
	Предупреждение.ТекстОшибки = ТекстОшибки;
	Предупреждения.Добавить(Предупреждение);
	
КонецПроцедуры

// Параметры:
//  ВидЭлектронногоДокумента - СправочникСсылка.ВидыДокументовЭДО
//  ВерсияФормата - Строка - Версия формата, в которой выполняется формирование документа.
//  ИдентификаторПолучателя - Строка
//  ДатаПроверки - Неопределено
//               - Дата
// 
// Возвращаемое значение:
//  Структура:
//  * ФорматыОтправителя - Неопределено
//                         Структура:
//                         * Отправитель_Формат_Представление - Строка
//                         * Отправитель_Формат_СсылкаНаПриказ - Строка
//                         * Регламентированный - Булево
//                         * Отправитель_НовыйФормат_Представление - Строка
//                         * Отправитель_НовыйФормат_СсылкаНаПриказ - Строка
//                         * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//                         * ПоддерживаетсяКонфигурацией - Булево
//  * ФорматыПолучателя - Неопределено
//                        Структура:
//                        * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//                        * Получатель_Формат_Представление - Строка
//                        * Получатель_Формат_СсылкаНаПриказ - Строка
//                        * Устарел - Булево
//                        * Отправитель_Формат_Представление - Строка
//                        * Отправитель_Формат_СсылкаНаПриказ - Строка
// 
Функция ДанныеОФорматахОтправителяИПолучателя(ВидЭлектронногоДокумента, ВерсияФормата, ИдентификаторПолучателя, ДатаПроверки = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ФорматыОтправителя", Неопределено);
	Результат.Вставить("ФорматыПолучателя", Неопределено);
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_03.ИнформацияПродавца Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ФорматыЭлектронныхДокументов = ЭлектронныеДокументыЭДО.ФорматыЭлектронныхДокументов();
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторФормата", ВерсияФормата);
	Отбор.Вставить("Отключен", Истина);
	ОтключенныеФорматы = ФорматыЭлектронныхДокументов.НайтиСтроки(Отбор);
	ФорматОтключен = ОтключенныеФорматы.Количество();
	Если ФорматОтключен Тогда
		СтарыйФормат = ОтключенныеФорматы[0];
		ФорматыЭлектронныхДокументов.Сортировать("Приоритет Убыв");
		Форматы = ФорматыЭлектронныхДокументов.НайтиСтроки(Новый Структура("ВидДокумента", ВидЭлектронногоДокумента));
		Если Форматы.Количество() Тогда
			НовыйФормат = Форматы[0];
		КонецЕсли;
		ФорматыОтправителя = Новый Структура;
		ФорматыОтправителя.Вставить("Отправитель_Формат_Представление", СтарыйФормат.ПредставлениеФормата);
		ФорматыОтправителя.Вставить("Отправитель_Формат_СсылкаНаПриказ", СтарыйФормат.СсылкаНаПриказОВведении);
		ФорматыОтправителя.Вставить("Регламентированный", СтарыйФормат.Формализованный);
		ФорматыОтправителя.Вставить("Отправитель_НовыйФормат_Представление", НовыйФормат.ПредставлениеФормата);
		ФорматыОтправителя.Вставить("Отправитель_НовыйФормат_СсылкаНаПриказ", НовыйФормат.СсылкаНаПриказОВведении);
		ФорматыОтправителя.Вставить("ВидДокумента", ВидЭлектронногоДокумента);
		ФорматыОтправителя.Вставить("ПоддерживаетсяКонфигурацией", СтарыйФормат.ПоддерживаетсяКонфигурацией); 
		
		Результат.ФорматыОтправителя = ФорматыОтправителя;
		
		Если НовыйФормат.ИдентификаторФормата = ПоддерживаемыеФорматы.УПД_5_03.ИнформацияПродавца Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	ВариантыЗаполнения = ЭлектронныеДокументыЭДО.РасшифровкаВариантовЗаполненияФорматовЭДО();
	ОписаниеВидаДокумента = ЭлектронныеДокументыЭДО.ОписаниеВидаДокумента(ВидЭлектронногоДокумента);
	Отбор = Новый Структура;
	Отбор.Вставить("ТипДокумента", ОписаниеВидаДокумента.ТипДокумента);
	ВариантыЗаполнения = ВариантыЗаполнения.Скопировать(Отбор);
	ВариантыЗаполнения.Колонки.Добавить("ВидДокумента", Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовЭДО"));
	ВариантыЗаполнения.ЗаполнитьЗначения(ВидЭлектронногоДокумента, "ВидДокумента");
	
	Отбор = РаботаСАбонентамиЭДО.НовыйОтборПоддерживаемыхФорматов();
	Отбор.ИдентификаторЭДО = "&ИдентификаторПолучателя";
	ЗапросФорматовАбонента = СинхронизацияЭДО.ЗапросПоддерживаемыхФорматов(
		"ПоддерживаемыеФорматыЭлектронныхДокументов", Отбор);
	
	Запросы = Новый Массив;
	Запросы.Добавить(ЗапросФорматовАбонента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыЗаполнения.Формат КАК Формат,
		|	ВариантыЗаполнения.ВидДокумента КАК ВидДокумента,
		|	ВариантыЗаполнения.ВариантЗаполнения КАК ВариантЗаполнения
		|ПОМЕСТИТЬ ВариантыЗаполнения
		|ИЗ
		|	&ВариантыЗаполнения КАК ВариантыЗаполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Форматы.ИдентификаторФормата КАК ИдентификаторФормата,
		|	Форматы.ВидДокумента КАК ВидДокумента,
		|	Форматы.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ Форматы
		|ИЗ
		|	&Форматы КАК Форматы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВариантыЗаполнения.ВидДокумента КАК ВидДокумента,
		|	ВариантыЗаполнения.Формат КАК Формат
		|ИЗ
		|	ПоддерживаемыеФорматыЭлектронныхДокументов КАК ПоддерживаемыеФорматыЭлектронныхДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВариантыЗаполнения КАК ВариантыЗаполнения
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Форматы КАК Форматы
		|			ПО Форматы.ИдентификаторФормата = ВариантыЗаполнения.Формат
		|				И Форматы.ВидДокумента = ВариантыЗаполнения.ВидДокумента
		|		ПО ПоддерживаемыеФорматыЭлектронныхДокументов.Формат = ВариантыЗаполнения.Формат
		|			И ПоддерживаемыеФорматыЭлектронныхДокументов.ВариантЗаполнения = ВариантыЗаполнения.ВариантЗаполнения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Форматы.Приоритет УБЫВ";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("ВариантыЗаполнения", ВариантыЗаполнения);
	ИтоговыйЗапрос.УстановитьПараметр("ИдентификаторПолучателя", ИдентификаторПолучателя);
	ИтоговыйЗапрос.УстановитьПараметр("Форматы", ФорматыЭлектронныхДокументов.Скопировать(, "ИдентификаторФормата, ВидДокумента, Приоритет"));
	РезультатЗапроса = ИтоговыйЗапрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторФормата", ВерсияФормата);
		ДанныеТекущегоФормата = ФорматыЭлектронныхДокументов.НайтиСтроки(Отбор);
		
		ТаблицаФорматовКонтрагента = РезультатЗапроса.Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Формат", ВерсияФормата);
		ТекущийФорматИспользуетсяКонтрагентом = ЗначениеЗаполнено(ТаблицаФорматовКонтрагента.НайтиСтроки(Отбор));
		
		Если ТекущийФорматИспользуетсяКонтрагентом Тогда
			ФорматыКонтрагента = ДанныеТекущегоФормата;
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторФормата", ТаблицаФорматовКонтрагента[0].Формат);
			Отбор.Вставить("Формализованный", Ложь);
			ФорматыКонтрагента = ФорматыЭлектронныхДокументов.НайтиСтроки(Отбор); 
		КонецЕсли;
		
		Если ФорматыКонтрагента.Количество() И ДанныеТекущегоФормата.Количество() Тогда
			ФорматКонтрагента = ФорматыКонтрагента[0];
			ФорматОрганизации = ДанныеТекущегоФормата[0];
			
			ФорматыПолучателя = Новый Структура;
			ФорматыПолучателя.Вставить("ВидДокумента", ВидЭлектронногоДокумента);
			ФорматыПолучателя.Вставить("Получатель_Формат_Представление", ФорматКонтрагента.ПредставлениеФормата);
			ФорматыПолучателя.Вставить("Получатель_Формат_СсылкаНаПриказ", ФорматКонтрагента.СсылкаНаПриказОВведении);
			ФорматыПолучателя.Вставить("Устарел", ФорматКонтрагента.Отключен);
			ФорматыПолучателя.Вставить("Отправитель_Формат_Представление", ФорматОрганизации.ПредставлениеФормата);
			ФорматыПолучателя.Вставить("Отправитель_Формат_СсылкаНаПриказ", ФорматОрганизации.СсылкаНаПриказОВведении);
			Результат.ФорматыПолучателя = ФорматыПолучателя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьДействияПередИзменениемИспользованияУтверждения(НовоеЗначение) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	Отказ = Ложь;
	НастройкиЭДОСобытия.ПередИзменениемИспользованияУтверждения(НовоеЗначение, КонтекстДиагностики, Отказ);
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Отказ);
	Результат.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	
	Возврат Результат;
	
КонецФункции

#Область Обновление

// См. НастройкиЭДОСобытия.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

#Область НачальноеЗаполнение
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Константы.ПриниматьПриглашенияЭДОАвтоматически.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("45562b2d-f775-4a8e-a881-5b8029f1888c");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Константа.ПриниматьПриглашенияЭДОАвтоматически";
	Обработчик.ИзменяемыеОбъекты = "Константа.ПриниматьПриглашенияЭДОАвтоматически";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Установка константы разрешающей автоматическое принятие приглашений от контрагентов при работе с ЭДО'");

#КонецОбласти

#Область Версия_1_2_2

#Область Справочники_УдалитьСоглашенияОбИспользованииЭД_ОбновитьВерсиюФорматаИсходящихЭД207_208

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.2.2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ОбновитьВерсиюФорматаИсходящихЭД207_208";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = ''");

#КонецОбласти

#КонецОбласти

#Область Версия_1_2_7

#Область Справочники_УдалитьСоглашенияОбИспользованииЭД_ОбновитьВерсиюФорматаИсходящихЭД501_502

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.7.2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ОбновитьВерсиюФорматаИсходящихЭД501_502";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = ''");

#КонецОбласти

#КонецОбласти

#Область Версия_1_3_2

#Область Справочники_УдалитьСоглашенияОбИспользованииЭД_УдалитьОтветныеТитулы

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.3.2.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.УдалитьСоглашенияОбИспользованииЭД.УдалитьОтветныеТитулы";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = ''");

#КонецОбласти

#Область НастройкиЭДОСлужебный_НастроитьАвтоПереходНаНовыеВерсииФорматовЭД

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.3.2.20";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "НастройкиЭДОСлужебный.НастроитьАвтоПереходНаНовыеВерсииФорматовЭД";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = ''");

#КонецОбласти

#КонецОбласти

#Область Версия_1_3_10

#Область ОбменСКонтрагентами_ВключитьИспользованиеОзнакомленийСЭД

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.3.10.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Процедура = "НастройкиЭДОСлужебный.ВключитьИспользованиеОзнакомленийСЭД";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("362ddf11-9595-418f-b695-436b7c60794d");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЧитаемыеОбъекты = "Константа.ИспользоватьОзнакомлениеСЭлектроннымиДокументами";
	Обработчик.ИзменяемыеОбъекты = "Константа.ИспользоватьОзнакомлениеСЭлектроннымиДокументами";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: включение отправки на ознакомление электронных документов.
	|Отправка электронных документов на ознакомление временно не производится.'");
	
#КонецОбласти

#КонецОбласти

#Область Версия_1_6_1

#Область НастройкиЭДОСлужебный_УстановкаЗначенияКонстантыСоздаватьКонтрагентовАвтоматическиБЭД
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.1.4";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Процедура = "НастройкиЭДОСлужебный.УстановкаЗначенияКонстантыСоздаватьКонтрагентовАвтоматическиБЭД";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("45562b2d-f775-4a8e-a881-5b8029f1779d");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Константа.СоздаватьКонтрагентовАвтоматическиБЭД";
	Обработчик.ИзменяемыеОбъекты = "Константа.СоздаватьКонтрагентовАвтоматическиБЭД";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Установка константы разрешающей автоматическое создание контрагентов при работе с ЭДО'");

#КонецОбласти

#КонецОбласти

#Область Версия_1_6_4

#Область Справочники_УдалитьСоглашенияОбИспользованииЭД_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.6.4.33";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.ОчередьОтложеннойОбработки = 2;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b46394ef-478c-49bd-a670-c508adb73281");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: изменение параметров справочника """"Настройки ЭДО"""". 
	|Настройка и обмен электронными документами с контрагентами временно невозможен.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ЭлектронныйДокументИсходящийЭДО.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Константы.ИспользоватьПрямойОбменЭлектроннымиДокументами.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.ОператорыЭДО.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.СостояниеОрганизацийБЭД.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.СостоянияКонтрагентовБЭД.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.УчетныеЗаписиЭДО.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.УдалитьПрофилиНастроекЭДО.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.УдалитьСоглашенияОбИспользованииЭД.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ИспользоватьПрямойОбменЭлектроннымиДокументами.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументов.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.СостояниеОрганизацийБЭД.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.СостоянияКонтрагентовБЭД.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыСведений.УчетныеЗаписиЭДО.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.Справочники.УдалитьСоглашенияОбИспользованииЭД.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ПолноеИмя());
	Блокируемые.Добавить(Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.ПолноеИмя());
	Блокируемые.Добавить(Метаданные.Справочники.УдалитьСоглашенияОбИспользованииЭД.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.НастройкиЗаполненияДополнительныхПолей.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "Любой";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.УдалитьПрофилиНастроекЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.УдалитьСертификатыЭП.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.ОператорыЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

#КонецОбласти

#КонецОбласти

#Область Версия_1_9_11
	
#Область НастройкиЭДОСлужебный_ТипПодписиЭД
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Константы.ТипПодписиЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.9.11.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("100d1559-2493-418c-873b-55f052bdab02");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Включает тип подписи по умолчанию для электронных документов'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ТипПодписиЭД.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ТипПодписиЭД.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
#КонецОбласти

#Область НастройкиЭДОСлужебный_ТипПодписиМЧД

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Константы.ТипПодписиМЧД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.9.11.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2b70f109-8722-4812-bb11-a35b2202f780");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Включает тип подписи по умолчанию для машиночитаемых доверенностей'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ТипПодписиМЧД.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ТипПодписиМЧД.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
#КонецОбласти

#КонецОбласти

#Область Версия_1_9_12

#Область Константы_ИспользоватьРазделениеДокументовПоОтветственнымЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Константы.ИспользоватьРазделениеДокументовПоОтветственнымЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.9.13.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9bd91cbc-2d89-45cc-8d2c-9941d0a32e23");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Выключает использование разделения документов по ответственным лицам, в информационных базах где количество пользователей меньше двух.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ИспользоватьРазделениеДокументовПоОтветственнымЭДО.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.Пользователи.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ИспользоватьРазделениеДокументовПоОтветственнымЭДО.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Константы.ИспользоватьРазделениеДокументовПоОтветственнымЭДО.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

#КонецОбласти

#КонецОбласти

#Область Версия_1_9_15

#Область Константы_ИспользоватьКонтрольОтраженияВУчетеЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Константы.ИспользоватьКонтрольОтраженияВУчетеЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.9.15.0";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f26c365d-e04d-4b9c-810f-65b47756f4cf");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: Константа Использовать контроль отражения в учете включается по умолчанию.'");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ИспользоватьКонтрольОтраженияВУчетеЭДО.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Константы.ИспользоватьКонтрольОтраженияВУчетеЭДО.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

#КонецОбласти

#КонецОбласти

КонецПроцедуры

// Обработчик обновления БЭД 1.6.1.4
// Процедура - Выполняет первоначальное заполнение регистра на основе справочника контрагентов.
// 		Заполнение выполняется:
// 		1. После ручного включения проверки фоновым заданием.
// 		2. В режиме сервисов - обновлением ИБ в каждой области отдельно.
//
// Параметры:
//  Параметры	 - Структура,Неопределено - Параметры очереди заданий в модели сервиса.
//		В локальной версии - Неопределено.
Процедура УстановкаЗначенияКонстантыСоздаватьКонтрагентовАвтоматическиБЭД(Параметры) Экспорт
	
	Параметры.ПрогрессВыполнения.ВсегоОбъектов = 1;
	
	МетаданныеОбъекта = Метаданные.Константы.СоздаватьКонтрагентовАвтоматическиБЭД;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов = 0;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Записать = Ложь;
		
		Менеджер = Константы.СоздаватьКонтрагентовАвтоматическиБЭД.СоздатьМенеджерЗначения();
		Менеджер.Прочитать();
		
		Если Не Менеджер.Значение Тогда
			Менеджер.Значение = Истина;
			Записать = Истина;
		КонецЕсли;
		
		Если Записать Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Менеджер);
		Иначе
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Менеджер, ПараметрыОтметкиВыполнения);
		КонецЕсли;
		
		ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
		ТекстСообщения = НСтр("ru = 'Не удалось обработать константу ""Создавать контрагентов автоматически БЭД"" по причине:'") 
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,, ТекстСообщения);
		
	КонецПопытки;
		
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось обработать константу ""Создавать контрагентов автоматически БЭД"".'");
		ВызватьИсключение ТекстСообщения;
	Иначе
		ТекстСообщения = НСтр("ru = 'Обработана константа ""Создавать контрагентов автоматически БЭД"".'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбработанныхОбъектов;
	
	Параметры.ОбработкаЗавершена = (ОбработанныхОбъектов > 0);

	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.2.20
// Переносит настройки контекста криптографии в объект БСП СоздаватьЭлектронныеПодписиНаСервере.
//
Процедура НастроитьАвтоПереходНаНовыеВерсииФорматовЭД() Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УдалитьСоглашенияОбИспользованииЭД.Ссылка КАК НастройкаЭДО
		|ИЗ
		|	Справочник.УдалитьСоглашенияОбИспользованииЭД КАК УдалитьСоглашенияОбИспользованииЭД
		|ГДЕ
		|	НЕ УдалитьСоглашенияОбИспользованииЭД.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НастройкаЭДО = Выборка.НастройкаЭДО.ПолучитьОбъект();
			НастройкаЭДО.АвтоПереходНаНовыеФорматы = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru = 'Обновление подсистемы обмена с контрагентами'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'При обновлении подсистемы обмена с контрагентами произошла ошибка'");
		ОбработкаНеисправностейБЭД.ОбработатьОшибку(Операция,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами, ПодробныйТекстОшибки, ТекстСообщения);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Включает использование механизма ознакомления с электронными документами.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//                          См. документацию по подсистеме СтандартныеПодсистемы.ОбновлениеВерсииИБ.
//
Процедура ВключитьИспользованиеОзнакомленийСЭД(Параметры) Экспорт
	
	Параметры.ПрогрессВыполнения.ВсегоОбъектов = 1;
	
	МетаданныеОбъекта = Метаданные.Константы.ИспользоватьОзнакомлениеСЭлектроннымиДокументами;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов = 0;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Записать = Ложь;
		
		Менеджер = Константы.ИспользоватьОзнакомлениеСЭлектроннымиДокументами.СоздатьМенеджерЗначения();
		Менеджер.Прочитать();
		
		Если Не Менеджер.Значение Тогда
			Менеджер.Значение = Истина;
			Записать = Истина;
		КонецЕсли;
		
		Если Записать Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Менеджер);
		Иначе
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Менеджер, ПараметрыОтметкиВыполнения);
		КонецЕсли;
		
		ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
		ТекстСообщения = НСтр("ru = 'Не удалось обработать константу ""Использовать ознакомление с электронными документами"" по причине:'") 
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,, ТекстСообщения);
		
	КонецПопытки;
		
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось обработать константу ""Использовать ознакомление с электронными документами"".'");
		ВызватьИсключение ТекстСообщения;
	Иначе
		ТекстСообщения = НСтр("ru = 'Обработана константа ""Использовать ознакомление с электронными документами"".'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбработанныхОбъектов;
	
	Параметры.ОбработкаЗавершена = (ОбработанныхОбъектов > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
